2013/brp 2013-02-07/ARTengine/tags/v1.0.1/VoorbeeldScript/request_template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.bprbzk.nl/BRP/0001">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:bevragen_VraagDetailsPersoon ns:cIDVerzendend="id.detailsPersoon">
         <ns:stuurgegevens ns:cIDVerzendend="id.stuurgegevens">
            <ns:organisatie>${DataSource Values#organisatie}</ns:organisatie>
            <ns:applicatie>${DataSource Values#applicatie}</ns:applicatie>
            <ns:referentienummer>${DataSource Values#referentienummer}</ns:referentienummer>
         </ns:stuurgegevens>
         <ns:vraag>
            <ns:zoekcriteria ns:cIDVerzendend="id.zoekcriteria">
               <ns:burgerservicenummer>${DataSource Values#burgerservicenummer}</ns:burgerservicenummer>
            </ns:zoekcriteria>
         </ns:vraag>
      </ns:bevragen_VraagDetailsPersoon>
   </soapenv:Body>
</soapenv:Envelope>
